Repository: jesss77/FYP
Catalog: Resources/Localization/SharedResource.*.resx
Languages: fr

source: Language
fr: Langue

source: English
fr: Anglais

source: French
fr: Français

source: Login
fr: Connexion

# Register
source: Sign Up
fr: Inscription

source: Book a Table
fr: Réserver une Table

source: Book a Table Now
fr: Réserver Maintenant

source: Make a Reservation
fr: Faire une Réservation

# Guest Reservation Subtitle
source: We look forward to welcoming you. Please provide the following details to secure your reservation.
fr: Nous avons hâte de vous accueillir. Fournissez les détails pour confirmer votre réservation.

source: Please provide your email.
fr: Veuillez fournir votre adresse e-mail.

source: Please provide your first name.
fr: Veuillez fournir votre prénom.

source: Please provide your last name.
fr: Veuillez fournir votre nom.

source: Please select a valid party size, date and time.
fr: Veuillez sélectionner une taille de groupe, une date et une heure valides.

source: About Us
fr: À Propos

source: Explore More
fr: Explorer Plus

# Hero Tagline
source: Elevated dining crafted with passion and finesse.
fr: Une cuisine raffinée façonnée avec passion et finesse.

# FooterQuote
source: "Where flavors meet elegance, and time slows down."
fr: « Où les saveurs rencontrent l'élégance et le temps ralentit. »

# FooterHours
source: Mon - Sun : 9 am - 12 am
fr: Lun - Dim : 9 h - 0 h

# FooterRights
source: © 2025 Fine'O Dine. All Rights Reserved
fr: © 2025 Fine’O Dine. Tous droits réservés

source: Experience Culinary Excellence
fr: Vivez l'Excellence Culinaire

# WelcomeDescription
source: Your go-to app for booking the best dining experiences in your city.
fr: Votre application pour réserver les meilleures expériences culinaires.

source: Why Dine With Us?
fr: Pourquoi Dîner Chez Nous ?

source: Discover what makes our dining experience unique.
fr: Découvrez ce qui rend notre expérience culinaire unique.

source: Instant Booking
fr: Réservation Instantanée

source: Reserve your table in seconds with our seamless booking system.
fr: Réservez votre table en quelques secondes grâce à notre système intuitif.

source: Artisanal Menu
fr: Menu Artisanal

source: Explore a curated menu of signature dishes made with the finest ingredients.
fr: Découvrez un menu de plats signatures élaborés avec des ingrédients de qualité.

source: Unforgettable Ambiance
fr: Ambiance Inoubliable

source: Immerse yourself in a sophisticated and welcoming atmosphere.
fr: Plongez dans une atmosphère sophistiquée et accueillante.

source: Menu Highlights
fr: À la Carte

source: A glimpse into our culinary creations.
fr: Un aperçu de nos créations culinaires.

source: Fresh Salads
fr: Salades Fraîches

source: Artisan Pizza
fr: Pizza Artisanale

source: Signature Pasta
fr: Pâtes Signatures

source: Gourmet Burgers
fr: Burgers Gourmets

source: Reservations Served
fr: Réservations Servies

source: Customer Satisfaction
fr: Satisfaction Client

source: Awards Won
fr: Prix Reçus

source: Pending Approval
fr: En Attente d'Approbation

source: Pending Confirmation
fr: Confirmation en Attente

source: Your account has been created and is awaiting your verification by email.
fr: Votre compte a été créé et attend votre vérification par email.

source: Return Home
fr: Retour à l'Accueil

source: Customer Dashboard
fr: Tableau de Bord Client

source: Welcome
fr: Bienvenue

source: Manage your reservations and book your next exceptional meal
fr: Gérez vos réservations et réservez votre prochain repas exceptionnel

source: Upcoming
fr: À Venir

source: Past Visits
fr: Visites Passées

source: My Reservations
fr: Mes Réservations

source: View all your bookings
fr: Voir toutes vos réservations

source: New Reservation
fr: Nouvelle Réservation

source: Book a table now
fr: Réserver une table maintenant

source: Time
fr: Heure

source: Party Size
fr: Nombre de Personnes

source: Duration
fr: Durée

source: Special Requests
fr: Demandes Spéciales

source: Optional
fr: Optionnel

source: Any dietary restrictions or special occasions?
fr: Des restrictions alimentaires ou occasions spéciales?

source: Reserve Table
fr: Réserver la Table

source: Recent Reservations
fr: Réservations Récentes

source: You don't have any reservations yet. Make your first booking!
fr: Vous n'avez pas encore de réservations. Faites votre première réservation!

source: Guest
fr: Invité

source: Guests
fr: Invités

source: Cancel
fr: Annuler

source: Are you sure you want to cancel this reservation?
fr: Êtes-vous sûr de vouloir annuler cette réservation?

source: View All Reservations
fr: Voir Toutes les Réservations

source: View and manage all your bookings
fr: Voir et gérer toutes vos réservations

source: Upcoming Reservations
fr: Réservations à Venir

source: Completed Reservations
fr: Réservations Terminées

source: Cancelled Reservations
fr: Réservations Annulées

source: Past Reservations
fr: Réservations Passées

source: Booked
fr: Réservé le

source: No Reservations Yet
fr: Aucune Réservation

source: You don't have any reservations. Make your first booking to get started!
fr: Vous n'avez aucune réservation. Faites votre première réservation pour commencer!

source: Make Your First Reservation
fr: Faire Votre Première Réservation

source: Status
fr: Statut

source: Admin Dashboard
fr: Tableau de Bord Admin

source: Manage your restaurant operations
fr: Gérez les opérations de votre restaurant

source: Employees
fr: Employés

source: View and manage all employee accounts
fr: Voir et gérer tous les comptes employés

source: View Employees
fr: Voir les Employés

source: Table Management
fr: Gestion des Tables

source: View and manage restaurant tables
fr: Voir et gérer les tables du restaurant

source: Manage Tables
fr: Gérer les Tables

source: Restaurant Settings
fr: Paramètres du Restaurant

source: Manage key-value settings for the restaurant
fr: Gérer les paramètres du restaurant

source: Manage Settings
fr: Gérer les Paramètres

source: Manage employee accounts and permissions
fr: Gérer les comptes et permissions des employés

source: Add New Employee
fr: Ajouter un Employé

source: Total Employees
fr: Total des Employés

source: Total Managers
fr: Total des Managers

source: Total Customers
fr: Total des Clients

source: Active
fr: Actif

source: Inactive
fr: Inactif

source: Name
fr: Nom

source: Phone Number
fr: Numéro de Téléphone

source: Edit
fr: Modifier

source: Deactivate
fr: Désactiver

source: Activate
fr: Activer

source: Delete
fr: Supprimer

source: Add
fr: Ajouter

source: Joined
fr: Inscrit le

source: Not provided
fr: Non fourni

source: No Employees Yet
fr: Aucun Employé

source: Add your first employee to get started
fr: Ajoutez votre premier employé pour commencer

source: Are you sure you want to delete {0} {1}? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer {0} {1}? Cette action est irréversible.

source: Manage restaurant table configuration
fr: Gérer la configuration des tables du restaurant

source: Add New Table
fr: Ajouter une Table

source: Total Tables
fr: Total des Tables

source: Available
fr: Disponible

source: Joinable
fr: Joignable

source: Total Capacity
fr: Capacité Totale

source: Unavailable
fr: Indisponible

source: Table Number
fr: Numéro de Table

source: Capacity
fr: Capacité

source: people
fr: personnes

source: Yes
fr: Oui

source: No
fr: Non

source: Make Unavailable
fr: Rendre Indisponible

source: Make Available
fr: Rendre Disponible

source: No Tables Yet
fr: Aucune Table

source: Add your first table to get started
fr: Ajoutez votre première table pour commencer

source: Are you sure you want to delete Table {0}? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer la Table {0}? Cette action est irréversible.

source: Edit Profile
fr: Modifier le Profil

source: Update your personal information
fr: Mettez à jour vos informations personnelles

source: First Name
fr: Prénom

source: Last Name
fr: Nom

source: Email Address
fr: Adresse Email

source: Email cannot be changed. Contact support if needed.
fr: L'email ne peut pas être modifié. Contactez le support si nécessaire.

source: Preferred Language
fr: Langue Préférée

source: Profile Picture
fr: Photo de Profil

source: Leave empty to keep current picture
fr: Laissez vide pour conserver la photo actuelle

source: Include country code (e.g., +1 for US, +961 for Lebanon)
fr: Incluez le code pays (ex: +1 pour US, +961 pour Liban)

source: Save Changes
fr: Enregistrer les Modifications

source: Reserve your table for an exceptional dining experience
fr: Réservez votre table pour une expérience culinaire exceptionnelle

source: Reservation Name
fr: Nom de la Réservation

source: e.g., Birthday Dinner, Anniversary
fr: ex: Dîner d'Anniversaire, Anniversaire

source: Give your reservation a memorable name
fr: Donnez un nom mémorable à votre réservation

source: Back to Dashboard
fr: Retour au Tableau de Bord

source: Book
fr: Réserver

source: New Table
fr: Nouvelle Table

# AboutUsParagraph1
source: Founded with a passion for exceptional cuisine and warm hospitality, we have dedicated ourselves to creating unforgettable dining experiences. Our talented team of chefs brings together diverse culinary traditions, crafting dishes that celebrate both innovation and timeless techniques. Every ingredient is carefully sourced from local farmers and trusted suppliers who share our commitment to quality and sustainability.
fr: Fondé avec une passion pour la cuisine exceptionnelle et l'hospitalité chaleureuse, nous nous sommes consacrés à créer des expériences culinaires inoubliables. Notre équipe talentueuse de chefs réunit diverses traditions culinaires, créant des plats qui célèbrent à la fois l'innovation et les techniques intemporelles. Chaque ingrédient est soigneusement sélectionné auprès d'agriculteurs locaux et de fournisseurs de confiance qui partagent notre engagement envers la qualité et la durabilité.

# AboutUsParagraph2
source: From intimate dinners to grand celebrations, our elegant atmosphere provides the perfect backdrop for life's special moments. We believe that dining is more than just a meal—it's an experience that engages all the senses. Our attentive staff takes pride in delivering personalized service that makes every guest feel truly welcome. Whether you're joining us for a quick lunch or a leisurely evening, we promise an experience that will leave you eager to return.
fr: Des dîners intimes aux grandes célébrations, notre atmosphère élégante offre le cadre parfait pour les moments spéciaux de la vie. Nous croyons que dîner est plus qu'un simple repas—c'est une expérience qui engage tous les sens. Notre personnel attentionné est fier d'offrir un service personnalisé qui fait que chaque invité se sent vraiment le bienvenu. Que vous nous rejoigniez pour un déjeuner rapide ou une soirée tranquille, nous promettons une expérience qui vous donnera envie de revenir.

# Contact Us Title
source: Contact Us
fr: Nous Contacter

source: We'd love to hear from you. Reach out to us through any of the channels below.
fr: Nous serions ravis de vous entendre. Contactez-nous par l'un des canaux ci-dessous.

source: Call us on
fr: Appelez-nous au

source: E-mail us at
fr: Écrivez-nous à

source: Follow us on Instagram
fr: Suivez-nous sur Instagram

source: Follow us on Facebook
fr: Suivez-nous sur Facebook

source: We'll respond within 24 hours
fr: Nous répondrons dans les 24 heures

source: See our latest dishes
fr: Découvrez nos derniers plats

source: Join our community
fr: Rejoignez notre communauté

source: Our Story
fr: Notre Histoire

source: Discover the passion and philosophy behind our culinary excellence.
fr: Découvrez la passion et la philosophie derrière notre excellence culinaire.

source: A Legacy of Flavor
fr: Un Héritage de Saveur

source: Cuisine is a story. We tell ours with every plate we serve.
fr: La cuisine est une histoire. Nous racontons la nôtre avec chaque assiette que nous servons.

# Our Mission &amp; Values
source: Our Mission & Values
fr: Notre Mission & Valeurs

source: The principles that guide every decision we make.
fr: Les principes qui guident chaque décision que nous prenons.

source: Quality
fr: Qualité

source: Sourcing only the finest, local, and sustainable ingredients to ensure peak freshness and flavor in every dish.
fr: Sélectionner uniquement les ingrédients les plus fins, locaux et durables pour garantir une fraîcheur et une saveur optimales dans chaque plat.

source: Providing warm, intuitive, and impeccable service to make every guest feel welcomed and cherished.
fr: Offrir un service chaleureux, intuitif et impeccable pour que chaque invité se sente accueilli et choyé.

source: Continuously pushing culinary boundaries and exploring new techniques to create a unique and modern dining experience.
fr: Repousser continuellement les limites culinaires et explorer de nouvelles techniques pour créer une expérience gastronomique unique et moderne.

# Accolades &amp; Awards
source: Accolades & Awards
fr: Distinctions & Récompenses

source: We are honored to be recognized for our dedication to culinary excellence.
fr: Nous sommes honorés d'être reconnus pour notre dévouement à l'excellence culinaire.

source: Gourmet Guide
fr: Guide Gourmet

source: Epicurean Award
fr: Prix Épicurien

source: Five Star Alliance
fr: Alliance Cinq Étoiles

source: Best Wine List
fr: Meilleure Carte des Vins

source: Guest Reservation
fr: Réservation Invité

source: We look forward to welcoming you. Please provide the following details to secure your reservation.
fr: Nous avons hâte de vous accueillir. Veuillez fournir les détails suivants pour confirmer votre réservation.

source: More
fr: Plus

source: Opening Hours
fr: Heures d'Ouverture

source: Phone
fr: Téléphone

source: Mon-Sat: 10:00 AM - 10:00 PM
fr: Lun-Sam: 10h00 - 22h00

source: Select Language
fr: Sélectionner la Langue
